blog/2011/12/23/beagrep.org
#+title: beagrep, grep 2G source code in 0.23 second
# bhj-tags: beagrep

Beagrep can grep ~readlink~ in Android source code in +0.8+ 0.23[fn:improve] second when
cache is hot, and about 11 seconds when cache is cold.

Using [[https://github.com/ggreer/the_silver_searcher][ag]] or [[https://github.com/petdance/ack][ack]] or bare grep, the results are a couple of seconds when
cache is hot, or a couple of minutes when the cache is cold[fn:fact].

* Introduction

I still remember when I read the ``Linux Device Drivers'', 1st Edition, in the preface, the author says:

#+begin_quote
... The text you are approaching is the result of hours of patient grepping ...
#+end_quote

I have been using grep to read source code ever since. It's been
adequate for a long time, until I started reading Android source code
with it. I remember vividly how it took me 30 minutes[fn:correction]
to ~grep readlink~ in Android source code (with VCS directory and
binary files excluded).

Then I learned about the beagle software which is a desktop search
engine, and it occurred to me, what if I use beagle and grep together?
I mean, to use beagle first to decide the (relatively a lot smaller)
set of possible matching files (i.e., files that contained the word
~readlink~, taking the previous example), then invoke grep on this set
only. Usually the job can be done in the blink of an eye.

Beagrep is available on GNU/Linux, Mac OS (requires MacPorts) and
Windows (requires CYGWIN). It also works with CJK characters
correctly, as long as the document is in utf8.

Because beagrep is so fast, I have also developped some more use cases
besides simply grepping through Android source code, for e.g., finding
function call sites.

There are other tools similar to beagrep, discussed at the end of this
blog.

(Note a Chinese version of this page is available [[../../../2012/01/31/beagrep-cn.org][here]], but it may be
outdated).

* Install
** Linux install

*** Compile by yourself (the preferred way for Linux install)

To compile beagrep by yourself, using Ubuntu precise as an example:

#+begin_src sh
git clone https://github.com/baohaojun/beagrep.git -b for-ubuntu-precise
# you can also run "git branch -a" to see other versions of debian/ubuntu supported

# Install build dependencies. You can open debian/control and check
# the build dependencies and install all of them. The following
# command will try to install them automatically, but if it fails then
# you need figure out which packages to install manually. Good luck!
# Or you can contact some debian/ubuntu advanced user for help.
apt-get install $(cat debian/control | perl -ne 'print if m/Build-Depends/..m/Standards-Version/'|grep -v -e Build-Depends:\\\|Standards-Version|perl -npe 's/,/ /g')

# do the build
(set -e; autoreconf -i; ./configure; make -j4; sudo make install; echo OK)
#+end_src

***  <<using.deb>> Using .deb under debian/ubuntu

*Help!* This has stopped working, help needed. Really appreciate if
someone can fix this and tell me what went wrong. See the update
below.

*Update (2014-05-03)* I found that building and installing the lastest
version of beagrep deb package will sometimes cause runtime exception
when running on Ubuntu 12.04 (and maybe other versions too /2014-12-17/). So you are encouraged to build and
install from source code directly, which does not show this
problem. Another reason is these packages is quite outdated.

I have provided several .deb package files on github, one for debian
testing, 3 for ubuntu lucid(10.04), oneiric(11.10) and
precise(12.04). They are all for amd64. If you happen to be using one
of these, you can download them [[https://github.com/baohaojun/beagrep/downloads][here]]. Here's how to install it using
ubuntu 12.04 as an example. After you have downloaded the .deb file:

#+begin_src sh
dpkg -i beagrep-for-ubuntu-precise-2012-09-05-ae0a1a2.deb
# The above step will probably get dependency errors, so you fix it:
apt-get -f install
# This will install the dependence packages.
#+end_src



*** Build .deb by yourself

*Help!* This has stopped working, help needed. Really appreciate if
someone can fix this and tell me what went wrong. See the update
below.

*Update (2014-05-03)* I found that building and installing the lastest
version of beagrep deb package will sometimes cause runtime exception
when running on Ubuntu 12.04 (and maybe other versions too
/2014-12-17/). So you are encouraged to build and install from source
code directly, which does not show this problem.

Before someone volunteer to make beagrep into debian/ubuntu
distribution, you might also find a need to build .deb by yourself
(for e.g., to help your colleagues use beagrep easily without needing
to compile it themselves).

Here's how I do it:

1. Make sure you can compile beagrep manually by referring to the
   previous section.

2. Make a tar.gz of beagrep (note that the filename must be exact, it
   is required by dpkg):

   : tar czfv ~/.cache/beagrep_0.4.0.orig.tar.gz beagrep --exclude-vcs

3. Untar it and build the .deb package:

   #+BEGIN_EXAMPLE
   cd ~/tmp
   tar zxfv beagrep_0.4.0.orig.tar.gz
   cd beagrep
   dpkg-buildpackage
   #+END_EXAMPLE

   The .deb file is generated in the =~/tmp= directory.

4. Refer to [[using.deb]] for how to install.

** Windows install

Windows install can only be done compiling by yourself, and be warned,
it's not easy...

*** Install dependencies

You need install CYGWIN, Mono and sqlite for Windows.

For cygwin, you will need the following packages as the minimum (there
might be more, though I have tested these should be enough):

#+BEGIN_EXAMPLE
      nc util-linux git vim rsync inetutils apache2 shutdown make
      gnome-common gcc-core gcc-g++ mingw-gcc-core mingw-gcc-g++
      mingw64-i686-gcc-core mingw64-i686-gcc-g++
      mingw64-x86_64-gcc-core mingw64-x86_64-gcc-g++ screen
      cygutils-extra procps wget git-svn
#+END_EXAMPLE


(See [[https://github.com/baohaojun/system-config/raw/master/bin/windows/after-check-out.sh][after-check-out.sh]] for how I installed these packages automatically).

For Mono, default download and install from mono project website is OK.

For sqlite, you need download the .zip file for Windows and extract
the .dll into your $PATH.

