blog/2011/12/23/beagrep.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>beagrep, grep 2G source code in 0.23 second</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Bao Haojun" />
<link rel="stylesheet" href="/css/default.css" type="text/css" />
 <link rel="shortcut icon" href="/poison.png" type="image/png" />

</head>
<body>
<div id="preamble" class="status">
<div id="header">

  <h1 id="blog-title">

    包昊军的博客

  </h1>
  <p id="description">What you don't know, won't hurt you.</p>

</div>
</div>
<div id='bhj_article'>
  <div id='bhj_leftpane'>
<div id="content">
<h1 class="title">beagrep, grep 2G source code in 0.23 second</h1>
<p>
Beagrep can grep <code>readlink</code> in Android source code in <del>0.8</del> 0.23<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup> second when
cache is hot, and about 11 seconds when cache is cold.
</p>

<p>
Using <a href="https://github.com/ggreer/the_silver_searcher">ag</a> or <a href="https://github.com/petdance/ack">ack</a> or bare grep, the results are a couple of seconds when
cache is hot, or a couple of minutes when the cache is cold<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
I still remember when I read the ``Linux Device Drivers'', 1st Edition, in the preface, the author says:
</p>

<blockquote>
<p>
&#x2026; The text you are approaching is the result of hours of patient grepping &#x2026;
</p>
</blockquote>

<p>
I have been using grep to read source code ever since. It's been
adequate for a long time, until I started reading Android source code
with it. I remember vividly how it took me 30 minutes<sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup>
to <code>grep readlink</code> in Android source code (with VCS directory and
binary files excluded).
</p>

<p>
Then I learned about the beagle software which is a desktop search
engine, and it occurred to me, what if I use beagle and grep together?
I mean, to use beagle first to decide the (relatively a lot smaller)
set of possible matching files (i.e., files that contained the word
<code>readlink</code>, taking the previous example), then invoke grep on this set
only. Usually the job can be done in the blink of an eye.
</p>

<p>
Beagrep is available on GNU/Linux, Mac OS (requires MacPorts) and
Windows (requires CYGWIN). It also works with CJK characters
correctly, as long as the document is in utf8.
</p>

<p>
Because beagrep is so fast, I have also developped some more use cases
besides simply grepping through Android source code, for e.g., finding
function call sites.
</p>

<p>
There are other tools similar to beagrep, discussed at the end of this
blog.
</p>

<p>
(Note a Chinese version of this page is available <a href="../../../2012/01/31/beagrep-cn.html">here</a>, but it may be
outdated).
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Install</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Linux install</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Using .deb under debian/ubuntu</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
<b>Update (2014-05-03)</b> I found that building and installing the lastest
version of beagrep deb package will sometimes cause runtime exception
when running on Ubuntu 12.04. So you are encouraged to build and
install from source code directly, which does not show this problem.
</p>

<p>
I have provided several .deb package files on github, one for debian
testing, 3 for ubuntu lucid(10.04), oneiric(11.10) and
precise(12.04). They are all for amd64. If you happen to be using one
of these, you can download them <a href="https://github.com/baohaojun/beagrep/downloads">here</a>. Here's how to install it using
ubuntu 12.04 as an example. After you have downloaded the .deb file:
</p>

<div class="org-src-container">

<pre class="src src-sh">dpkg -i beagrep-for-ubuntu-precise-2012-09-05-ae0a1a2.deb
<span class="org-comment-delimiter"># </span><span class="org-comment">The above step will probably get dependency errors, so you fix it:</span>
apt-get -f install
<span class="org-comment-delimiter"># </span><span class="org-comment">This will install the dependence packages.</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Compile by yourself</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
If you need compile by yourself, using Ubuntu precise as an example:
</p>

<div class="org-src-container">

<pre class="src src-sh">git clone https://github.com/baohaojun/beagrep.git -b for-ubuntu-precise
<span class="org-comment-delimiter"># </span><span class="org-comment">you can also run "git branch -a" to see other versions of debian/ubuntu supported</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Install build dependencies. You can open debian/control and check</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">the build dependencies and install all of them. The following</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">command will try to install them automatically, but if it fails then</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">you need figure out which packages to install manually. Good luck!</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Or you can contact some debian/ubuntu advanced user for help.</span>
apt-get install $(<span class="org-sh-quoted-exec">cat</span> debian/control | perl -ne <span class="org-string">'print if m/Build-Depends/..m/Standards-Version/'</span>|grep -v -e Build-Depends:<span class="org-string">\\\|</span>Standards-Version|perl -npe <span class="org-string">'s/,/ /g'</span>)

<span class="org-comment-delimiter"># </span><span class="org-comment">do the build</span>
(<span class="org-builtin">set</span> -e; autoreconf -i; ./configure; make -j4; sudo make install; <span class="org-builtin">echo</span> OK)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> Build .deb by yourself</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
<b>Update (2014-05-03)</b> I found that building and installing the lastest
version of beagrep deb package will sometimes cause runtime exception
when running on Ubuntu 12.04. So you are encouraged to build and
install from source code directly, which does not show this problem.
</p>

<p>
Before someone volunteer to make beagrep into debian/ubuntu
distribution, you might also find a need to build .deb by yourself
(for e.g., to help your colleagues use beagrep easily without needing
to compile it themselves).
</p>

<p>
Here's how I do it:
</p>

<ol class="org-ol">
<li>Make sure you can compile beagrep manually by referring to the
previous section.
</li>

<li>Make a tar.gz of beagrep (note that the filename must be exact, it
is required by dpkg):

<pre class="example">
tar czfv ~/.cache/beagrep_0.4.0.orig.tar.gz beagrep --exclude-vcs
</pre>
</li>

<li>Untar it and build the .deb package:

<pre class="example">
cd ~/tmp
tar zxfv beagrep_0.4.0.orig.tar.gz
cd beagrep
dpkg-buildpackage
</pre>

<p>
The .deb file is generated in the <code>~/tmp</code> directory.
</p>
</li>

<li>Refer to <i>#using.deb</i> for how to install.
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Windows install</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Windows install can only be done compiling by yourself, and be
pre-warned, it's not easy&#x2026;
</p>
</div>

<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Install dependencies</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
You need install CYGWIN, Mono and sqlite for Windows.
</p>

<p>
For cygwin, you will need the following packages as the minimum (there
might be more, though I have tested these should be enough):
</p>

<pre class="example">
nc util-linux git vim rsync inetutils apache2 shutdown make
gnome-common gcc-core gcc-g++ mingw-gcc-core mingw-gcc-g++
mingw64-i686-gcc-core mingw64-i686-gcc-g++
mingw64-x86_64-gcc-core mingw64-x86_64-gcc-g++ screen
cygutils-extra procps wget git-svn
</pre>


<p>
(see <a href="https://github.com/baohaojun/system-config/raw/master/bin/windows/after-check-out.sh">after-check-out.sh</a> for how I installed these packages automatically).
</p>

<p>
For Mono, default download and install from mono project website is OK.
</p>

<p>
For sqlite, you need download the .zip file for Windows and extract
the .dll into your $PATH.
</p>
</div>
</div>
