blog/2011/12/23/beagrep.org
*** Get beagrep Windows code

#+begin_src sh
git clone git://github.com/baohaojun/beagrep.git -b for-windows
#+end_src

*** Compile and install

#+begin_src sh
cd beagrep
bash build-win.sh "/cygdrive/c/Program Files (x86)/Mono-3.2.3"
#+end_src

Now, the argument to build-win.sh is the folder where I have installed
mono, on my windows7, it is ~/cygdrive/c/Program Files
(x86)/Mono-3.2.3~. One thing very important in building and using
beagrep on Windows is to get the directory name format correct,
because Windows has very weird characters in its pathname, =:= and
=Space=, which is harmful for writing Makefile and Shell scripts,
respectively.

**** Fixing errors during build

Note that when you are building, compilation will fail complaining
=/usr/lib/gcc/i686-pc-mingw32/4.5.2/libstdc++.la= not found, this is
because it is specified in =C:/Program Files
(x86)/Mono-3.2.3/lib/pkgconfig/mono.pc=, and you need to edit this
file to remove it.

* Usage

** Quick smoke test
#+begin_src sh
cd /tmp; mkdir $$; cd $$; echo main > 1.txt; mkbeagrepidx; beagrep -e 'main' --grep '--color=auto'; true; cd ..; rm $$ -rf
#+end_src

If beagrep has been installed correctly, at the end of the above
command's output, you should see something like
~/.cache/11468/1.txt:1:main~.

** Create index

In your source code directory, using android as example:

#+begin_src sh
cd ~/src/android
mkbeagrepidx
#+end_src

This step will cost you quite some time, under my Linux indexing
Android cost me about half an hour (it's about the same time you run
grep directly on android source). So I'd advise you create a cron job
to do it at midnight.

It takes about 8 minutes to index linux kernel (v3.6-rc6):

#+begin_example
Debug: IndexWorker Done
Debug: Elapsed time 478.01s.
#+end_example

But the good news is if indexing has already been done before, there
re-indexing will only work on those updated files based on file
time-stamp. So it will cost you only a few minutes to re-index the
whole Android source.

Even better, after an initial indexing, you can do a sub-folder
re-index, ~mkbeagrepidx~ will ask you if you want to update the index
found for upper directory. This generally only takes seconds depending
on the size of the sub-folder.

** Man page for mkbeagrepidx

mkbeagrepidx is a simple wrapper over beagrep-build-index. You can
configure it for which directories to ignore using
~--deny-directory-pattern~ option. By default,

- The ~$PWD/out~ is ignored, because it contains android build output
- The */.git is ignored, because of well known reason
- The */.repo is ignored, for the same reason.

The syntax is comma separated shell glob patterns, and you can check
how it is converted into regular expression by examining the beginning
of mkbeagrepidx output:

#+begin_example
Always: Will ignore directories matching regular expression: ^(?:/home/bhj/tmp/test/out)$|^(?:.*/\.repo)$|^(?:.*/\.git)$
#+end_example

You can customize it using several ways, in the order of increasing
priority:

- Not customize it, then the default

  #+begin_example
  "$PWD/out,*/.repo,*/.git"
  #+end_example

  will be used.

- Override it in =~/.mkbeagrepidx.rc=, setting the ~BEAGREP_IGNORE_DIR_PATTERNS~ environment variable:

  #+begin_src sh
  export BEAGREP_IGNORE_DIR_PATTERNS="$PWD/out,*/.repo,*/.git"
  #+end_src

- Override it in the .mkbeagrepidx.rc in the current working directory, same as the above.

- Override it on the command line (you must repeat the default pattern
  because it won't append):

  #+begin_src sh
  mkbeagrepidx --deny-directory-pattern "$PWD/out,*/.repo,*/.git,*/.svn"
  #+end_src


** Searching using beagrep

Under your source code directory:
#+begin_src sh
cd ~/src/android
beagrep -e "readlink"
#+end_src

*** Man page for beagrep

Here's a list of all arguments that beagrep takes:

#+begin_example
beagrep -e REGEXP_MATCH [-p REGEXP_PATH] [-a ADDITIONAL_WORDS] [-v REGEXP_REVERSE_PATH] [-i] [-f] [-l] [--grep GREP_OPTIONS] [-a]
#+end_example

- -e ~REGEXP_MATCH~ :: This is the minimum required arguments. For e.g., ~beagrep -e readlink~

     The ~REGEXP_MATCH~ serves 2 purposes:

     - First, it is computed into whole words for querying beagle. For
       e.g., ~l] [--grep GREP_OPTIONS]~ above should be matched with
       the following REGEXP: ~l\] \[--grep GREP_OPTIONS\]~, but it
       should be converted into 4 words: ~l grep GREP OPTIONS~ for
       beagle.

     - Second, it is used as the regexp for grep to work on.

- -a ~ADDITIONAL_WORDS~ :: means to add more words into the beagle
     query. This is useful by increasing the work beagle need to do,
     but reduce the possible work set grep need to work on.

- -p ~REGEXP_PATH~ :: means to limit the search result to those files whose path-name matches ~REGEXP_PATH~.

- -v ~REGEXP_REVERSE_PATH~ :: means to exclude those matched files whose path-name matches ~REGEXP_REVERSE_PATH~.

- -i :: means to do case insignificant grep.

- -f :: means to do the match in file-names only. For example, ~beagrep
        -e readlink -f~ will only show results like readlink.h and
        readlink.c.

	This is very useful for finding files. Note that when ~-f~ is
        used, the beagle querying words will be computed differently:
        only the basename will be used, and ~filename:~ is prepended
        onto each words.

- -l :: means to list the beagle matched list of files directly, without running grep to match on them.

- --grep ~GREP_OPTIONS~ :: means to pass additional arguments to the
     grep invocation. For e.g., the ~-l~ argument can be passed to
     beagrep directly, or it can be passed using ~--grep~, they mean different things:

     ~beagrep -e "hello world" -l~ will show a file containing "hello
     wonderful world", but ~beagrep -e "hello world" --grep -l~ will
     not show that file as a match.


* How does it work?

beagrep is a very practical software, it works because of the following observations:

