blog/2011/12/23/beagrep.html

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Get beagrep Windows code</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">

<pre class="src src-sh">git clone git://github.com/baohaojun/beagrep.git -b for-windows
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> Compile and install</h4>
<div class="outline-text-4" id="text-2-2-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">cd</span> beagrep
bash build-win.sh <span class="org-string">"/cygdrive/c/Program Files (x86)/Mono-3.2.3"</span>
</pre>
</div>

<p>
Now, the argument to build-win.sh is the folder where I have installed
mono, on my windows7, it is <code>/cygdrive/c/Program Files
(x86)/Mono-3.2.3</code>. One thing very important in building and using
beagrep on Windows is to get the directory name format correct,
because Windows has very weird characters in its pathname, <code>:</code> and
<code>Space</code>, which is harmful for writing Makefile and Shell scripts,
respectively.
</p>
</div>

<ol class="org-ol"><li>Fixing errors during build<br  /><div class="outline-text-5" id="text-2-2-3-1">
<p>
Note that when you are building, compilation will fail complaining
<code>/usr/lib/gcc/i686-pc-mingw32/4.5.2/libstdc++.la</code> not found, this is
because it is specified in <code>C:/Program Files
(x86)/Mono-3.2.3/lib/pkgconfig/mono.pc</code>, and you need to edit this
file to remove it.
</p>
</div>
</li></ol>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Usage</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Quick smoke test</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">cd</span> /tmp; mkdir $<span class="org-variable-name">$</span>; <span class="org-builtin">cd</span> $<span class="org-variable-name">$</span>; <span class="org-builtin">echo</span> main &gt; 1.txt; mkbeagrepidx; beagrep -e <span class="org-string">'main'</span> --grep <span class="org-string">'--color=auto'</span>; true; <span class="org-builtin">cd</span> ..; rm $<span class="org-variable-name">$</span> -rf
</pre>
</div>

<p>
If beagrep has been installed correctly, at the end of the above
command's output, you should see something like
<code>/.cache/11468/1.txt:1:main</code>.
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Create index</h3>
<div class="outline-text-3" id="text-3-2">
<p>
In your source code directory, using android as example:
</p>

<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">cd</span> ~/src/android
mkbeagrepidx
</pre>
</div>

<p>
This step will cost you quite some time, under my Linux indexing
Android cost me about half an hour (it's about the same time you run
grep directly on android source). So I'd advise you create a cron job
to do it at midnight.
</p>

<p>
It takes about 8 minutes to index linux kernel (v3.6-rc6):
</p>

<pre class="example">
Debug: IndexWorker Done
Debug: Elapsed time 478.01s.
</pre>

<p>
But the good news is if indexing has already been done before, there
re-indexing will only work on those updated files based on file
time-stamp. So it will cost you only a few minutes to re-index the
whole Android source.
</p>

<p>
Even better, after an initial indexing, you can do a sub-folder
re-index, <code>mkbeagrepidx</code> will ask you if you want to update the index
found for upper directory. This generally only takes seconds depending
on the size of the sub-folder.
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Man page for mkbeagrepidx</h3>
<div class="outline-text-3" id="text-3-3">
<p>
mkbeagrepidx is a simple wrapper over beagrep-build-index. You can
configure it for which directories to ignore using
<code>--deny-directory-pattern</code> option. By default,
</p>

<ul class="org-ul">
<li>The <code>$PWD/out</code> is ignored, because it contains android build output
</li>
<li>The */.git is ignored, because of well known reason
</li>
<li>The */.repo is ignored, for the same reason.
</li>
</ul>

<p>
The syntax is comma separated shell glob patterns, and you can check
how it is converted into regular expression by examining the beginning
of mkbeagrepidx output:
</p>

<pre class="example">
Always: Will ignore directories matching regular expression: ^(?:/home/bhj/tmp/test/out)$|^(?:.*/\.repo)$|^(?:.*/\.git)$
</pre>

<p>
You can customize it using several ways, in the order of increasing
priority:
</p>

<ul class="org-ul">
<li>Not customize it, then the default

<pre class="example">
"$PWD/out,*/.repo,*/.git"
</pre>

<p>
will be used.
</p>
</li>

<li>Override it in <code>~/.mkbeagrepidx.rc</code>, setting the <code>BEAGREP_IGNORE_DIR_PATTERNS</code> environment variable:

<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">export</span> <span class="org-variable-name">BEAGREP_IGNORE_DIR_PATTERNS</span>=<span class="org-string">"$PWD/out,*/.repo,*/.git"</span>
</pre>
</div>
</li>

<li>Override it in the .mkbeagrepidx.rc in the current working directory, same as the above.
</li>

<li>Override it on the command line (you must repeat the default pattern
because it won't append):

<div class="org-src-container">

<pre class="src src-sh">mkbeagrepidx --deny-directory-pattern <span class="org-string">"$PWD/out,*/.repo,*/.git,*/.svn"</span>
</pre>
</div>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Searching using beagrep</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Under your source code directory:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">cd</span> ~/src/android
beagrep -e <span class="org-string">"readlink"</span>
</pre>
</div>
</div>

<div id="outline-container-sec-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> Man page for beagrep</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
Here's a list of all arguments that beagrep takes:
</p>

<pre class="example">
beagrep -e REGEXP_MATCH [-p REGEXP_PATH] [-a ADDITIONAL_WORDS] [-v REGEXP_REVERSE_PATH] [-i] [-f] [-l] [--grep GREP_OPTIONS] [-a]
</pre>

<dl class="org-dl">
<dt> -e <code>REGEXP_MATCH</code> </dt><dd>This is the minimum required arguments. For e.g., <code>beagrep -e readlink</code>

<p>
The <code>REGEXP_MATCH</code> serves 2 purposes:
</p>

<ul class="org-ul">
<li>First, it is computed into whole words for querying beagle. For
e.g., <code>l] [--grep GREP_OPTIONS]</code> above should be matched with
the following REGEXP: <code>l\] \[--grep GREP_OPTIONS\]</code>, but it
should be converted into 4 words: <code>l grep GREP OPTIONS</code> for
beagle.
</li>

<li>Second, it is used as the regexp for grep to work on.
</li>
</ul>
</dd>

<dt> -a <code>ADDITIONAL_WORDS</code> </dt><dd>means to add more words into the beagle
query. This is useful by increasing the work beagle need to do,
but reduce the possible work set grep need to work on.
</dd>

<dt> -p <code>REGEXP_PATH</code> </dt><dd>means to limit the search result to those files whose path-name matches <code>REGEXP_PATH</code>.
</dd>

<dt> -v <code>REGEXP_REVERSE_PATH</code> </dt><dd>means to exclude those matched files whose path-name matches <code>REGEXP_REVERSE_PATH</code>.
</dd>

<dt> -i </dt><dd>means to do case insignificant grep.
</dd>

<dt> -f </dt><dd>means to do the match in file-names only. For example, <code>beagrep
        -e readlink -f</code> will only show results like readlink.h and
readlink.c.

<p>
This is very useful for finding files. Note that when <code>-f</code> is
used, the beagle querying words will be computed differently:
only the basename will be used, and <code>filename:</code> is prepended
onto each words.
</p>
</dd>

<dt> -l </dt><dd>means to list the beagle matched list of files directly, without running grep to match on them.
</dd>

<dt> &#x2013;grep <code>GREP_OPTIONS</code> </dt><dd>means to pass additional arguments to the
grep invocation. For e.g., the <code>-l</code> argument can be passed to
beagrep directly, or it can be passed using <code>--grep</code>, they mean different things:

<p>
<code>beagrep -e "hello world" -l</code> will show a file containing "hello
wonderful world", but <code>beagrep -e "hello world" --grep -l</code> will
not show that file as a match.
</p>
</dd>
</dl>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> How does it work?</h2>
<div class="outline-text-2" id="text-4">
<p>
beagrep is a very practical software, it works because of the following observations:
</p>
</div>
