blog/2011/12/23/beagrep.org
** grep patterns are usually simple

Or rather, they can be decomposed into several simple sub-patterns: whole words.

For example, to grep such a seemingly complex pattern in Android source code:

#+begin_example
"JsonToValue(\"\\\\\"hello world\\\\\"\","
#+end_example

In fact, it contained some simpler sub-patterns, i.e., those 3
wholesome English words: ~JsonToValue~ ~hello~ ~world~. For a file to
match this complex pattern, one necessary but not sufficient condition
is for this file to contain all these 3 words. And what is good for
this job? A search engine! Using beagle, the parent project for
beagrep, a desktop search engine, you can find which files (actually,
which file in this case) contained these 3 words in the blink of an
eye.

Only 1 file contained all 3 words:

#+begin_example
$beagrep-files 'JsonToValue hello world '
Beagrep index found at /home/bhj/.cache/for-code-reading//home/bhj/src/gingerbread-tegra/.beagrep
/home/bhj/src/gingerbread-tegra/external/chromium/base/json/json_reader_unittest.cc
/dev/null
#+end_example

So, you can imagine how quick it is to run ~grep~ on the set of files containing all required words:


#+BEGIN_EXAMPLE
beagrep -e "JsonToValue(\"\\\\\"hello world\\\\\"\","
pat is: 'JsonToValue("\\"hello world\\"",'.
beagrep query argument `JsonToValue hello world '
Beagrep index found at /home/bhj/.cache/for-code-reading//home/bhj/src/gingerbread-tegra/.beagrep
/home/bhj/src/gingerbread-tegra/external/chromium/base/json/json_reader_unittest.cc:168:  root.reset(JSONReader().JsonToValue("\"hello world\"", false, false));
Unmatched ( in regex; marked by <-- HERE in m/JsonToValue( <-- HERE ""hello world"",/ at /home/bhj/bin/beagrep line 98.
#+END_EXAMPLE

To summarize, complete words are what search engines are good for, and
fortunately, when grepping source code, we almost always grep using
whole words, instead of sub-words. For e.g., this evil pattern
~r.*e.*a.*d.*l.*i.*n.*k~ can match our ~readlink~, but do you really
need that power of ~grep~?

*** BTW, creating the regexp pattern automatically in Emacs

From the example above, you can see the actual matched string is:

#+begin_example
JsonToValue("\"hello world\"",
#+end_example

but because of meta characters in regexp and shell, the regexp pattern for beagrep to work on is a lot more complex:

#+begin_example
"JsonToValue(\"\\\\\"hello world\\\\\"\","
#+end_example

It'd be tragedy if you need type all those ~\~ characters by
yourself. So of course I didn't. In fact, when you work in Emacs,
after you marked some text and press ~C-u M-x grep~, Emacs will
correctly add the ~\~ -s for you, to convert this plain text into a
matching regexp (which can be passed to grep by the shell).

Note that last time I checked, the Emacs grep regexp generation code
has some bugs, so I rolled my own fix for it, you can check my [[https://github.com/baohaojun/system-config/raw/master/.emacs][.emacs]]
for definition of ~grep-default-command~ and
~grep-shell-quote-argument~.

** grep keywords are usually interesting

beagrep can greatly quicken the speed of grep, only because it can
greatly reduce the working set of files for grep.

Note that you need provide interesting words to search for so as to
*greatly* reduce the working set. By interesting I mean non-common.

For e.g., say you want to grep ~is~. This word is so common in English
that almost all files would probably contain it (source code file will
probably contain it in comments). Then you are basically running grep
nakedly on the whole android source.

Fortunately, this requirement is easy to meet. In the first place, you
probably don't want to grep for common words; and even if you do need
to, you probably won't grep for one common word *alone*, which is very
uninteresting; thirdly, even if you do need to ~grep~ for a common
word alone, you can provide more words for ~beagrep~ to work on by
using its ~-a~ option (see the manpage above).

So:

- Don't grep for ~include~ alone, because almost all C/C++ source and
  header files contain it.

- Don't grep for ~import~ alone, because almost all java source files
  contain it.

And so on.

* Other projects using beagrep

Because beagrep is so fast, I have used it in a couple other projects/tools.

** offline Wikipedia

I added CJK character support into beagrep so that both English and
Chinese offline Wikipedia can be browsed and subject-searched.

Check it out at [[https://github.com/baohaojun/system-config]], sorry I
didn't make it a stand-alone project, it's under the
~gcode/offline.wikipedia~ directory.

