blog/2011/12/23/beagrep.html

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> grep patterns are usually simple</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Or rather, they can be decomposed into several simple sub-patterns: whole words.
</p>

<p>
For example, to grep such a seemingly complex pattern in Android source code:
</p>

<pre class="example">
"JsonToValue(\"\\\\\"hello world\\\\\"\","
</pre>

<p>
In fact, it contained some simpler sub-patterns, i.e., those 3
wholesome English words: <code>JsonToValue</code> <code>hello</code> <code>world</code>. For a file to
match this complex pattern, one necessary but not sufficient condition
is for this file to contain all these 3 words. And what is good for
this job? A search engine! Using beagle, the parent project for
beagrep, a desktop search engine, you can find which files (actually,
which file in this case) contained these 3 words in the blink of an
eye.
</p>

<p>
Only 1 file contained all 3 words:
</p>

<pre class="example">
$beagrep-files 'JsonToValue hello world '
Beagrep index found at /home/bhj/.cache/for-code-reading//home/bhj/src/gingerbread-tegra/.beagrep
/home/bhj/src/gingerbread-tegra/external/chromium/base/json/json_reader_unittest.cc
/dev/null
</pre>

<p>
So, you can imagine how quick it is to run <code>grep</code> on the set of files containing all required words:
</p>


<pre class="example">
beagrep -e "JsonToValue(\"\\\\\"hello world\\\\\"\","
pat is: 'JsonToValue("\\"hello world\\"",'.
beagrep query argument `JsonToValue hello world '
Beagrep index found at /home/bhj/.cache/for-code-reading//home/bhj/src/gingerbread-tegra/.beagrep
/home/bhj/src/gingerbread-tegra/external/chromium/base/json/json_reader_unittest.cc:168:  root.reset(JSONReader().JsonToValue("\"hello world\"", false, false));
Unmatched ( in regex; marked by &lt;-- HERE in m/JsonToValue( &lt;-- HERE ""hello world"",/ at /home/bhj/bin/beagrep line 98.
</pre>

<p>
To summarize, complete words are what search engines are good for, and
fortunately, when grepping source code, we almost always grep using
whole words, instead of sub-words. For e.g., this evil pattern
<code>r.*e.*a.*d.*l.*i.*n.*k</code> can match our <code>readlink</code>, but do you really
need that power of <code>grep</code>?
</p>
</div>

<div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> BTW, creating the regexp pattern automatically in Emacs</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
From the example above, you can see the actual matched string is:
</p>

<pre class="example">
JsonToValue("\"hello world\"",
</pre>

<p>
but because of meta characters in regexp and shell, the regexp pattern for beagrep to work on is a lot more complex:
</p>

<pre class="example">
"JsonToValue(\"\\\\\"hello world\\\\\"\","
</pre>

<p>
It'd be tragedy if you need type all those <code>\</code> characters by
yourself. So of course I didn't. In fact, when you work in Emacs,
after you marked some text and press <code>C-u M-x grep</code>, Emacs will
correctly add the <code>\</code> -s for you, to convert this plain text into a
matching regexp (which can be passed to grep by the shell).
</p>

<p>
Note that last time I checked, the Emacs grep regexp generation code
has some bugs, so I rolled my own fix for it, you can check my <a href="https://github.com/baohaojun/system-config/raw/master/.emacs">.emacs</a>
for definition of <code>grep-default-command</code> and
<code>grep-shell-quote-argument</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> grep keywords are usually interesting</h3>
<div class="outline-text-3" id="text-4-2">
<p>
beagrep can greatly quicken the speed of grep, only because it can
greatly reduce the working set of files for grep.
</p>

<p>
Note that you need provide interesting words to search for so as to
<b>greatly</b> reduce the working set. By interesting I mean non-common.
</p>

<p>
For e.g., say you want to grep <code>is</code>. This word is so common in English
that almost all files would probably contain it (source code file will
probably contain it in comments). Then you are basically running grep
nakedly on the whole android source.
</p>

<p>
Fortunately, this requirement is easy to meet. In the first place, you
probably don't want to grep for common words; and even if you do need
to, you probably won't grep for one common word <b>alone</b>, which is very
uninteresting; thirdly, even if you do need to <code>grep</code> for a common
word alone, you can provide more words for <code>beagrep</code> to work on by
using its <code>-a</code> option (see the manpage above).
</p>

<p>
So:
</p>

<ul class="org-ul">
<li>Don't grep for <code>include</code> alone, because almost all C/C++ source and
header files contain it.
</li>

<li>Don't grep for <code>import</code> alone, because almost all java source files
contain it.
</li>
</ul>

<p>
And so on.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Other projects using beagrep</h2>
<div class="outline-text-2" id="text-5">
<p>
Because beagrep is so fast, I have used it in a couple other projects/tools.
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> offline Wikipedia</h3>
<div class="outline-text-3" id="text-5-1">
<p>
I added CJK character support into beagrep so that both English and
Chinese offline Wikipedia can be browsed and subject-searched.
</p>

<p>
Check it out at <a href="https://github.com/baohaojun/system-config">https://github.com/baohaojun/system-config</a>, sorry I
didn't make it a stand-alone project, it's under the
<code>gcode/offline.wikipedia</code> directory.
</p>
</div>
</div>
