blog/2011/12/23/beagrep.html

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> <code>grep-func-call</code> and <code>grep-func-call-all</code></h3>
<div class="outline-text-3" id="text-5-2">
<p>
These 2 scripts generate the function usage relationship for easier
code reading. Given a function funcA, which is used in a bunch of other functions in the system, these 2 scripts work like this:
</p>

<ol class="org-ol">
<li>Use beagrep to find out in which files funcA appears.
</li>

<li>Run ctags-exuberant to tag these files, get the function definition
lines: In file FileF, funcB is defined on line N, funcC is defined
on line M, and no other functions are between N and M.
</li>

<li>If funcA appears in FileF, between line N and line M, then funcB
calls funcA. This is not precise, but it's good enough.
</li>

<li>It not only works with functions, but also with almost all complete
words that beagrep can handle.
</li>
</ol>

<p>
The first script works with the current Emacs buffer only, the 2nd
works system-wide, searching function call sites though out the whole
source repo.
</p>

<p>
See the following output, note that grep-mode is used for jumping
around, and <code>=&gt; and &lt;=</code> is used to denote the caller and caller:
</p>

<div class="org-src-container">

<pre class="src src-grepout">-*- mode: grep; default-directory: "~/src/android/kernel/drivers/staging/android/" -*-
Grep started at Mon Jun 30 13:18:42

grep-func-call -e "BINDER_WRITE_READ" --nc -a


Entering directory `<span class="org-function-name">/home/bhj/src/android/bionic/libc/kernel/common/linux</span>'
<span class="org-underline"><span class="org-compilation-info">binder.h</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">61</span></span><span class="org-underline">:</span> &lt;=  signed long protocol_version;
<span class="org-underline"><span class="org-compilation-info">binder.h</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">65</span></span><span class="org-underline">:</span> =&gt; #define BINDER_WRITE_READ _IOWR('b', 1, struct binder_write_read)
Entering directory `<span class="org-function-name">/home/bhj/src/android/external/kernel-headers/original/linux</span>'
<span class="org-underline"><span class="org-compilation-info">binder.h</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">81</span></span><span class="org-underline">:</span> &lt;=         signed long     protocol_version;
<span class="org-underline"><span class="org-compilation-info">binder.h</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">87</span></span><span class="org-underline">:</span> =&gt; #define BINDER_WRITE_READ               _IOWR('b', 1, struct binder_write_read)
Entering directory `<span class="org-function-name">/home/bhj/src/android/external/valgrind/main/coregrind/m_syswrap</span>'
<span class="org-underline"><span class="org-compilation-info">syswrap-linux.c</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">4258</span></span><span class="org-underline">:</span> &lt;= PRE(sys_ioctl)
<span class="org-underline"><span class="org-compilation-info">syswrap-linux.c</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">5498</span></span><span class="org-underline">:</span> =&gt;            PRE_FIELD_READ("ioctl(BINDER_WRITE_READ).write_buffer",
<span class="org-underline"><span class="org-compilation-info">syswrap-linux.c</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">5500</span></span><span class="org-underline">:</span> =&gt;            PRE_FIELD_READ("ioctl(BINDER_WRITE_READ).write_size",
<span class="org-underline"><span class="org-compilation-info">syswrap-linux.c</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">5502</span></span><span class="org-underline">:</span> =&gt;            PRE_FIELD_READ("ioctl(BINDER_WRITE_READ).write_consumed",
<span class="org-underline"><span class="org-compilation-info">syswrap-linux.c</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">5504</span></span><span class="org-underline">:</span> =&gt;            PRE_FIELD_READ("ioctl(BINDER_WRITE_READ).read_buffer",
<span class="org-underline"><span class="org-compilation-info">syswrap-linux.c</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">5506</span></span><span class="org-underline">:</span> =&gt;            PRE_FIELD_READ("ioctl(BINDER_WRITE_READ).read_size",
<span class="org-underline"><span class="org-compilation-info">syswrap-linux.c</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">5508</span></span><span class="org-underline">:</span> =&gt;            PRE_FIELD_READ("ioctl(BINDER_WRITE_READ).read_consumed",
<span class="org-underline"><span class="org-compilation-info">syswrap-linux.c</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">5511</span></span><span class="org-underline">:</span> =&gt;            PRE_FIELD_WRITE("ioctl(BINDER_WRITE_READ).write_consumed",
<span class="org-underline"><span class="org-compilation-info">syswrap-linux.c</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">5513</span></span><span class="org-underline">:</span> =&gt;            PRE_FIELD_WRITE("ioctl(BINDER_WRITE_READ).read_consumed",
<span class="org-underline"><span class="org-compilation-info">syswrap-linux.c</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">5517</span></span><span class="org-underline">:</span> =&gt;                PRE_MEM_WRITE("ioctl(BINDER_WRITE_READ).read_buffer[]",
<span class="org-underline"><span class="org-compilation-info">syswrap-linux.c</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">5520</span></span><span class="org-underline">:</span> =&gt;                PRE_MEM_READ("ioctl(BINDER_WRITE_READ).write_buffer[]",
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/native/cmds/servicemanager</span>'
<span class="org-underline"><span class="org-compilation-info">binder.c</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">142</span></span><span class="org-underline">:</span> &lt;= int binder_write(struct binder_state *bs, void *data, unsigned len)
<span class="org-underline"><span class="org-compilation-info">binder.c</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">152</span></span><span class="org-underline">:</span> =&gt;     res = ioctl(bs-&gt;fd, BINDER_WRITE_READ, &amp;bwr);
<span class="org-underline"><span class="org-compilation-info">binder.c</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">303</span></span><span class="org-underline">:</span> &lt;= int binder_call(struct binder_state *bs,
<span class="org-underline"><span class="org-compilation-info">binder.c</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">339</span></span><span class="org-underline">:</span> =&gt;         res = ioctl(bs-&gt;fd, BINDER_WRITE_READ, &amp;bwr);
<span class="org-underline"><span class="org-compilation-info">binder.c</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">357</span></span><span class="org-underline">:</span> &lt;= void binder_loop(struct binder_state *bs, binder_handler func)
<span class="org-underline"><span class="org-compilation-info">binder.c</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">375</span></span><span class="org-underline">:</span> =&gt;         res = ioctl(bs-&gt;fd, BINDER_WRITE_READ, &amp;bwr);
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/native/libs/binder</span>'
<span class="org-underline"><span class="org-compilation-info">IPCThreadState.cpp</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">795</span></span><span class="org-underline">:</span> &lt;= status_t IPCThreadState::talkWithDriver(bool doReceive)
<span class="org-underline"><span class="org-compilation-info">IPCThreadState.cpp</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">848</span></span><span class="org-underline">:</span> =&gt;         if (ioctl(mProcess-&gt;mDriverFD, BINDER_WRITE_READ, &amp;bwr) &gt;= 0)
Entering directory `<span class="org-function-name">/home/bhj/src/android/kernel/drivers/staging/android</span>'
<span class="org-underline"><span class="org-compilation-info">binder.c</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">2690</span></span><span class="org-underline">:</span> &lt;= static long binder_ioctl(struct file *filp, unsigned int cmd, unsigned long arg)
<span class="org-underline"><span class="org-compilation-info">binder.c</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">2712</span></span><span class="org-underline">:</span> =&gt;       case BINDER_WRITE_READ: {
Entering directory `<span class="org-function-name">/home/bhj/src/android/kernel/drivers/staging/android</span>'
<span class="org-underline"><span class="org-compilation-info">binder.h</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">81</span></span><span class="org-underline">:</span> &lt;=         signed long     protocol_version;
<span class="org-underline"><span class="org-compilation-info">binder.h</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">87</span></span><span class="org-underline">:</span> =&gt; #define BINDER_WRITE_READ               _IOWR('b', 1, struct binder_write_read)

Grep finished (<span class="org-compilation-info">matches found</span>) at Mon Jun 30 13:18:46
</pre>
</div>
</div>
</div>
